certificate/sc-japan/4장. 정보보안관리 실천/4.9 사업계속관리.org
#+TITLE: 사업계속관리

* BCP, BCM의 개요
- 사업계속관리(BCM, Business Continuity Management)
- 사업계속계획(BCP, Business Continuity Plan)

** 사업계속관리에 관한 ISMS 요구항목
- 조직은 곤란한 상황 (위협, 재해)시 정보보안 및 정보보안 관리를 계속하기 위한 요구사항을 결정해두어야 한다.
- 곤란한 상황에서 정보보안을 계속하기 위한 프로세스, 순서, 관리책 등을 문서화하고 실시/유지할 것
- 위의 관리책이 타당하고 유효한 것임을 확실히 하기 위해 정기적으로 검증할 것
- 정보처리시설이 가용성 요구사항을 만족하기 위해 충분한 여유를 가지고 있을 것 (이중화 등)


** BCM과 BCP의 동향
- 영국의 BCI(Business Continuity Institute, 사업계속협회)에서 선구적 역할을 하고 있음.
- 일본에는 BCI Japan Alliance 가 존재

** BCM에 관한 규격 및 인증제도
*** 규격
ISO 22301:2012 -> 사회보안 사업계속관리시스템 요구항목

*** 인증제도
JIPDEC에 의해 위 규격에 맞춰 *BCMS 적합성평가제도* 를 운영중


* BCP 책정, BCM 확립에 있어서의 요점
- BCM에서느 중요도가 높은 사업이나 서비스가 우선적으로 복구/계속되어야 하는 것이 전제된다.
- BCP에서는 우선 비즈니스 임팩트 분석(Business Inpact Analysis, BIA)를 통해 해당 조직의 사업계속에서 보틀넥이 되는 직무프로세스나 리스크를 파악한다.

BIA에 의해 파악된 중요한 업무에 대해 중단되었을 때의 손실액등을 산출하는 것과 동시에 다음의 목표치를 설정한다.
- 목표복구시간(Recovery Time Objective, RTO) : 업무중단 후 언제까지 업무를 복구해야하는지
- 목표복구레벨 : 업무중단 후 RTO 내의 어떤 레벨까지 업무를 복구할 것인지
- 목표복구시점(Recovery Point Objective, RPO) : 업무중단부터 거꾸로 시간을 되돌렸을 때 어느 시점의 상태까지 되돌릴 것인가

중요업무의 중지 시, 목표시간내에 복구하기 위한 구체적인 계획이나 순서를 BCP로서 책정한다.
BCP 책정 시에는 다음과 같은 복구 단계를 상정해서 대응한다.
- 긴급대응 페이즈 : 재해나 사고 등의 인시던트가 발생한 직후의 대응 단계
- 업무재개 페이즈 : 가장 중요도가 높은 업무를 재개하는 단계
- 업무회복 페이즈 : 중요도가 낮은 업무까지 재개하는 단계
- 완전회복 페이즈 : 모든 업무를 정상적으로 계속할 수 있는 체계로 이행하는 단계

BCP를 정기적으로 훈련하고 시험하는 것으로 
- BCP의 유효성을 점검할 수 있다. 
- 조직에 BCM문화를 뿌리내릴 수 있다. 

업무 내용이나 업무환경이 변화되었을 때는 적시에 BIA를 실시, BCP를 재검토한다.

